
// created by 2019/11/28
function comefrom(loca, locacity) { this.loca = loca; this.locacity = locacity; }
let where=[];
where[0] = new comefrom("--XX省--", "--XX市--");
where[1] = new comefrom("北京 100000", "东城|西城|崇文|宣武|朝阳|丰台|石景山|海淀|门头沟|房山|通州|顺义|昌平|大兴|平谷|怀柔|密云|延庆");
where[2] = new comefrom("上海 200000", "黄浦|卢湾|徐汇|长宁|静安|普陀|闸北|虹口|杨浦|闵行|宝山|嘉定|浦东|金山|松江|青浦|南汇|奉贤|崇明");
where[3] = new comefrom("天津 300000", "和平|东丽|河东|西青|河西|津南|南开|北辰|河北|武清|红挢|塘沽|汉沽|大港|宁河|静海|宝坻|蓟县");
where[4] = new comefrom("重庆 400000", "万州|涪陵|渝中|大渡口|江北|沙坪坝|九龙坡|南岸|北碚|万盛|双挢|渝北|巴南|黔江|长寿|綦江|潼南|铜梁|大足|荣昌|壁山|梁平|城口|丰都|垫江|武隆|忠县|开县|云阳|奉节|巫山|巫溪|石柱|秀山|酉阳|彭水|江津|合川|永川|南川");
where[5] = new comefrom("河南", "郑州 450000 |开封 475000 |洛阳 471000 |平顶山 467000 |安阳 455000 |鹤壁 458000 |新乡 453000 |焦作 454150 |濮阳 457000 |许昌 461000 |漯河 461000 |三门峡 472000 |南阳 473000 |商丘 476000 |信阳 464000 |周口 466000 |驻马店 463000 |济源 459000");
where[6] = new comefrom("山西", "太原 030000 |大同 037000 |阳泉 045000 |长治 046000 |晋城 048000 |朔州 038500 |吕梁 033000 |忻州 038500 |晋中 038300 |临汾 041000 |运城 044000 ");
where[7] = new comefrom("内蒙古", "呼和浩特 010000 |包头 014000 |乌海 016000 |赤峰 024000 |呼伦贝尔盟 021000 |阿拉善盟 750306|哲里木盟 028099  |兴安盟 137400|乌兰察布盟 012000 |锡林郭勒盟 026000 |巴彦淖尔盟 015000 |伊克昭盟");
where[8] = new comefrom("辽宁", "沈阳 110000 |大连 116000 |鞍山 114000 |抚顺 113000 |本溪 117000 |丹东 118000 |锦州 121000 |营口 115000 |阜新 123000 |辽阳 111000|盘锦 124000 |铁岭 112000 |朝阳 122000 |葫芦岛 125000 ");
where[9] = new comefrom("吉林", "长春 130000 |吉林 132000 |四平 136000 |辽源 136200 |通化 134000 |白山 134300 |松原 138000 |白城 137000 |延边 133000 ");
where[10] = new comefrom("黑龙江", "哈尔滨 150000 |齐齐哈尔 161000 |牡丹江 157000 |佳木斯 154000 |大庆 163000 |绥化 152000 |鹤岗 154100 |鸡西 158100 |黑河 164300 |双鸭山 155100 |伊春 153000 |七台河 154600 |大兴安岭 165000 ");
where[11] = new comefrom("江苏", "南京 210000 |镇江 212000 |苏州 215000|南通 226000 |扬州 225000|盐城 224000 |徐州 221000 |连云港 222000 |常州 213000 |无锡 214000 |宿迁 223800 |泰州 225300 |淮安 223001 ");
where[12] = new comefrom("浙江", "杭州 310000 |宁波 315000 |温州 325000 |嘉兴 314000 |湖州 313000 |绍兴 312000 |金华 321000 |衢州 324000 |舟山 316000 |台州 318000 |丽水 323000 ");
where[13] = new comefrom("安徽", "合肥 230000 |芜湖 241000 |蚌埠 233000 |马鞍山 243000|淮北 235000 |铜陵 244000 |安庆 246000 |黄山 245000 |滁州 239000 |宿州 234000 |池州 247100 |淮南 232000 |巢湖 238000 |阜阳 236000 |六安 237000 |宣城 242000 |亳州 236000 ");
where[14] = new comefrom("福建", "福州 350000 |厦门 361000 |莆田 351100 |三明 365000 |泉州 362000 |漳州 363000 |南平 353000 |龙岩 364000 |宁德 352000 ");
where[15] = new comefrom("江西", "南昌市 330000 |景德镇 333000 |九江 332000 |鹰潭 335000 |萍乡 337000 |新馀 336500 |赣州 341000 |吉安 343000 |宜春 336000 |抚州 344000 |上饶 334000 ");
where[16] = new comefrom("山东", "济南 250000 |青岛 266000 |淄博 255000 |枣庄 277000 |东营 257000 |烟台 264000 |潍坊 261000 |济宁 272000 |泰安 271000 |威海 264200 |日照 276800 |莱芜 271100 |临沂 276000 |德州 253000 |聊城 252000 |滨州 256600 |菏泽 274000 ");
where[17] = new comefrom("河北", "石家庄 050000 |邯郸 056000 |邢台 054000 |保定 071000 |张家口 075000 |承德 067000 |廊坊 065000 |唐山 063000 |秦皇岛 066000 |沧州 061000 |衡水 053000 ");
where[18] = new comefrom("湖北", "武汉 430000 |宜昌 443000 |荆州 434000 |襄樊 441000 |黄石 435000 |荆门 448000 |黄冈 438000 |十堰 442000 |恩施 445000 |潜江 433100|天门 431700|仙桃 433000|随州 441300 |咸宁 437000 |孝感 432000 |鄂州 436000 ");
where[19] = new comefrom("湖南", "长沙 410000 |常德 415000 |株洲 412000 |湘潭 411100 |衡阳 421000 |岳阳 414000 |邵阳 422000 |益阳 413000 |娄底 417000 |怀化 418000 |郴州 423000|永州 425000 |湘西 416000 |张家界 427000 ");
where[20] = new comefrom("广东", "广州 510000 |深圳 518000 |珠海 519000 |汕头 515000 |东莞 523000 |中山 528400 |佛山 528000 |韶关 512000 |江门 529000 |湛江 524000 |茂名 525000 |肇庆 526000 |惠州 516000 |梅州 514000 |汕尾 516600 |河源 517000 |阳江 529500 |清远 511500 |潮州 521000 |揭阳 522000 |云浮 527300 ");
where[21] = new comefrom("广西", "南宁 530000 |柳州 545000 |桂林 541000 |梧州 543000 |北海 536000 |防城港 538000 |钦州 535000 |贵港 537000 |玉林 537000 |贺州 542800 |百色 533000 |河池 547000 |来宾 546100 |崇左 532200  ");
where[22] = new comefrom("海南", "海口 570100|三亚 572000");
where[23] = new comefrom("四川", "成都 610000 |绵阳 621000 |德阳 618000 |自贡 643000 |攀枝花 617000 |广元 628000 |内江 641000 |乐山 614000 |南充 637000 |宜宾 644000 |广安 638500 |达川 635000 |雅安 625000 |眉山 620000 |甘孜 626000|凉山 615000|泸州 646000 ");
where[24] = new comefrom("贵州", "贵阳 550000|六盘水 553000|遵义 563000|安顺 561000|铜仁 554300|黔西南 562400|毕节 551700|黔东南 556000|黔南 558000");
where[25] = new comefrom("云南", "昆明 650000|大理 671000|曲靖 655000|玉溪 653100|昭通 657000|楚雄 675000|红河 661400|文山 663000|思茅 665000|西双版纳 666100|保山 678000|德宏 678400|丽江 674100|怒江 673100|迪庆 674400|临沧 677000");
where[26] = new comefrom("西藏", "拉萨 850000|日喀则 857000|山南 856000|林芝 860000|昌都 854000|阿里 859000|那曲 852000");
where[27] = new comefrom("陕西", "西安 710000|宝鸡 721000|咸阳 712000|铜川 727000|渭南 714000|延安 716000|榆林 719000|汉中 723000|安康 725000|商洛 726000");
where[28] = new comefrom("甘肃", "兰州 730000|嘉峪关 735100|金昌 737100|白银 730900|天水 741000|酒泉 735000|张掖 734000|武威 733000|定西 743000|陇南 742500|平凉 744000|庆阳 745000|临夏 731100|甘南 747000");
where[29] = new comefrom("宁夏", "银川 750000|石嘴山 753000|吴忠 751100|固原 756000|中卫 751700 ");
where[30] = new comefrom("青海", "西宁 810000|海东 810600|海南 813000|海北 812200|黄南 811300|玉树 815000|果洛 814000|海西 817000");
where[31] = new comefrom("新疆", "乌鲁木齐 830000|石河子 832000|克拉玛依 834000|伊犁 835000|巴音郭勒 841000|昌吉 831100|克孜勒苏柯尔克孜 845350|博尔塔拉 833400|吐鲁番 838000|哈密 839000|喀什 844000|和田 848000|阿克苏 843000");
where[32] = new comefrom("香港 999077", "");
where[33] = new comefrom("澳门 999078", "");
where[34] = new comefrom("台湾", "--请选择--|台北|高雄|台中|台南|屏东|南投|云林|新竹|彰化|苗栗|嘉义|花莲|桃园|宜兰|基隆|台东|金门|马祖|澎湖");
where[35] = new comefrom("其它", "北美洲|南美洲|亚洲|非洲|欧洲|大洋洲");

export default where;